Repository: atlas-studios/Session2-G2
Catalog: omegat/project_save.tmx
Source language: zh_cn
Languages: en_us

source: 那柳长老瞪了江逸一眼，手中开始亮起红色元力单手附在丹炉侧壁上，不过他眸子一转，突然转头朝江逸招手道：“你，过来！给这炉丹药先回火，老夫去看看丹方。”
en_us: Elder Liu stared at Jiang Yi as the single hand he placed on the cauldron walls started glowing with red essence force. However, he shifted his pupils and turned his head towards Jiang Yi as he waved his hand, ordering, "You, get over here! Help me temper the flames of this cauldron of elixirs; I am going to check the elixir formula."

source: 那洞极深，他们足足往下飞了两分钟，才落到了实地，四周一片漆黑，孤月扬手唤出一团火照明。这才看清，四周空荡荡的没有一物，一片寂静。可却并没有那狐妖的身影，明明妖气这么浓烈。
en_us: The pit was so deep that they had to fly down for two minutes before they reached the ground. It was pitch black down there. Lonemoon raised his hands to summon a fire. Now they could see that there was nothing around. The whole place was silent. Although the demonic aura was still prominent, there was no sign of the fox demon.

source: 那游仙双手背在身后，一副大义凛然的样子，“此事还有许多不明之处，我等来此，只是想彻底查清。如果只是普通的一场机缘纷争，我等也不必大张其鼓的来此。”
en_us: That Traveling Immortal's hands were behind his back and he had a strong air of righteousness about him. "This matter has a lot of grey areas, which is why we are all here to get a better understanding of it. If it were only a normal fight of fate, we would have not come here with such great fanfare."

source: 那游仙愣了一下，转头四下找寻了几遍，半会才将视线定在了羿清身边，一个举着手的女子身上，皱心顿时拧了拧。
en_us: The Traveling Immortal hesitated before he searched the ground below him. A few seconds passed before his eyes landed on the woman beside Yi Qing. Her hand was raised. His troubled heart suddenly fell quiet.

source: 那游仙瞬间黑了脸，到是他旁边一人忍不住出声道，“你何必跟她废话这么多，反正这千叶草木灵不能落入轩辕家以外的人手里，她不给也得给！”
en_us: The Traveling Immortal's expression darkened immediately. Another Traveling Immortal beside him couldn't stop himself from interrupting, "Why do you bother talking to this woman? No matter what, nobody else but the Xuan Yuan Family can possess a Thousand Leaves Vegetation Spirit. She has no choice but to hand it over!"

source: 那游仙脸色变了变，笑得更加的深道，“道友，这只千叶草木灵灵智不低，好好养护或许用不了多久就可以化形，恕我直言这世间除了我轩辕家，怕是无人护得住此等宝物。道友现在孑然一身，无门无派，又何苦再得罪一个世家。”
en_us: The Traveling Immortal's expression changed. His smile widened as he said, "Fellow Daoist, this Thousand Leaves Vegetation Spirit has quite a high sentience. With proper care and protection, it may manifest after a short while. Forgive me for being blunt — apart from my Xuan Yuan Family, I don't think anyone else has the capabilities to provide the proper care and protection for it. You, my fellow Daoist, are now on your own. You don't belong to any family or sect. Why would you want to offend an aristocratic family?"

source: 那火龙大吼了一声，龙吟之声连着大地都颤动起来，火龙冲天而起，张开大嘴就朝着羿清飞了过去。
en_us: The inferno dragon roared loudly, causing the entire place to vibrate. It flew up into the air toward Yi Qing, opening its mouth wide.

source: 那炼丹师脸上露出一丝失望之色，再次看了一下丹药，很快转身朝外走去，同时交代管事：“好好招待这位客人，我先去请示一下二小姐。”
en_us: That alchemist reveal a sliver of disappointment on his face. Looking at the elixirs once again, he quickly turned his body and walked out of the booth. At the same time, he instructed the manager by saying, "Entertain this customer well, I need to consult with Second Young Mistress for a moment."

source: 那石峰升到半空，峰顶开始电闪雷呜，一道紫色的闪电破空而至，空中突然开始扭曲起来，不到半会峰顶出现了一个半透明宛如水镜一般的入口。隐隐还能看到里面的另一片天地，仙山渺渺灵气逼人，群山间灵气浓郁得惊人，隐隐还透出七彩雾光。
en_us: The peak continued to stand tall. Lightning and thunder started to come from the top of the peak. A purple flash of lightning shot through the sky as the surrounding air began to stir. Suddenly, a translucent entrance started to form on the peak. Peering in, one would just be able to make out that there was a plain on the other side. The beautiful spirit Qi was almost oppressive - it was surprisingly thick. There was also a hint of a rainbow fog light.

source: 那砣金钢芭比是什么鬼？还我软萌的弟子啊喂！
en_us: What’s that iron barbie doing? Return me my gentle and cute disciple!

source: 那管事接过令牌，脸上露出不出意料的神情，不过他并没有立即答应，反而低头沉吟起来。
en_us: The housekeeper received the token with a look of astonishment, yet he did not immediately respond; instead, he lowered his head and started muttering to himself.

source: 那管事放声大笑，嘲弄的望着江逸道：“道理？你这侍女在我这做工，我可少了他一分银钱？她不好好做工？竟跑去内堂，毁掉了我们楼主在聚珍阁重金购买的一副名画。还有……你这小子不问青红皂白，冲进来就打伤我们风月楼的护卫！既然你要说道理，那要不我们去你们江家刑堂说去？哼哼……今日不给个说法，这事就算闹到哪去都没完。”
en_us: The housekeeper laughed aloud. He stared at Jiang Yi and replied sarcastically, "Justice? Your maidservant works for me. Have I ever not paid her a cent less? She did not do her work properly, you know? Not only did she brazenly run to the inner court, she even destroyed a famous painting that our Fengyue Brothel boss bought at an exorbitant price. "On top of that... you, little brat, you did not bother finding out what happened, and just rushed in and attacked our guards here at Fengyue Brothel indiscriminately! Since you say you want to serve justice, then should we go over to your Jiang Clan Disciplinary Court to seek that justice? Hmph... if you can't give us an explanation or a solution, we will be at an impasse and the problem will not go away."

source: 那管事满眸都是惊疑走前几步，目光在江逸身上打了几个转，开口问道：“迷幻步？幻影拳？缠丝手？你是江家的子弟？敢问是谁家的公子？江家的几位爷鄙人倒是略有耳闻。”
en_us: That housekeeper took several steps forward, his eyes giving a look of bewilderment. Taking several glances at Jiang Yi from top to bottom, he asked, "Psychedelic Step? Phantom Punch? Silk Hand? Are you a member of the Jiang Clan? Dare I ask, are you a young master, and which family do you belong? This humble servant has indeed heard of some of the young masters of the Jiang Clan."

source: 那翊飞儿明显对江逸不感冒，等翊凌雪走了之后，淡淡的看着江逸一眼昂着头走进一个练功房内，在门口才漠然说道：“还不进来？”
en_us: Yi Fei-er was apparently uninterested in Jiang Yi. After Yi Lingxue's departure, she looked at Jiang Yi dispassionately and went into the Technique Practising Room with her head held up high. She stopped at the doors and said in an indifferent tone, "You are not coming inside?"

source: 那莲上的众人愣了一下，杀另外两位尊者的居然是她！细一看那水镜，的确在青尹死前影像里发现羿清旁边站着的就是这名女子，一时间看她的眼神充满了警惕，关键他们居然探不出这女子的修为。
en_us: The crowd on the Lotus Flower hesitated. She was the one who killed the other two elders! They looked closer at the crystal and realised that just before Qing Yin died, this woman was standing next to him. Her eyes were filled with warning. What's worse was that they couldn't figure out her cultivation level.

source: 那边江逸对着书册，仔细辨认，整整找了小半个时辰才找到柳长老所需的八九种药草，用一个小杆秤准确的秤好。
en_us: At the other corner of the building, Jiang Yi referenced the book and carefully identified the various medicinal herbs. It took an entire hour before he managed to find all nine medicinal herbs that Elder Liu requested. He used a small scale to accurately measure the right amount of each ingredient.

source: 那铸鼎境界三重旁系子弟江如鹰立即朝前走了两步，蹲了一个马步，满脸嘲弄的伸手指着胯下道：“来吧！钻过去。”
en_us: That collateral descendant Jiang Ruying, with a power level at the third stage of the Cast Tripod Realm, immediately took two steps forward and squatted down in a horse stance position. With a look of desire to make fun of Jiang Yi, he pointed towards the bottom of his groin and said, "Come on! Crawl through it!"

source: 那黑气似乎吓了一大跳，连忙原地转了一圈，开始在众弟子的招式下，上窜下跳起来。兴许是这内院太小，玄天宗来的弟子又多，人挤人的居然一时间让那妖给躲了过去。
en_us: Seemingly startled, the black Qi hurriedly turned around in a circle, and began to jump up and down in an attempt to fend off the attacks from the disciples. Perhaps this inner court yard was too small, and there were too many Blackheaven Sect disciples, but the demon actually managed to evade capture.

source: 那黑色元力竟从蓝色元力内分离出来，突然和附近的丹药药力融合了……
en_us: That black essence force actually separated from the blue essence force and suddenly merged with the nearby elixir powers...

source: 郁家家主一脸吃惊，用看神经病的眼神瞄了那两人一眼，这轩辕家莫不是疯了吧？但到底是别家的事，他又不好开口问，只能冷哼一声转过了头。
en_us: The Yu Family Patriarch was shocked, looking at the two men as if they were mad. Had the Xuan Yuan Family gone crazy? But it was none of his business after all, and it would not do for him to ask them about it, so he just snorted coldly and turned his head away.

source: 郁家家主郁海珩没有回沈萤的话，像是完全没有把她看在眼里。
en_us: The Yu Family Family Master, Yu Hai Heng, ignored Shen Ying. He could not even be bothered to acknowledge her.

source: 郁家经过这一回后，也彻底的龟缩起来，虽然底子厚，不至于就此倒掉，但少了游仙撑场子，在上青界的影响力终究不如以前。
en_us: The Yu Family kept a low profile after what had happened. They were low-key, but they weren't completely off the radar. Without any Traveling Immortals to their name, their influence in the Upper Azure World dwindled.

source: 郁昊天还没反应过来，下一刻他只觉得眼前一花，咚的一声响，一头砸在了地上。
en_us: Before Yu Haotian could react he felt something flash before his eyes,and then there was a loud bang as his head hit the ground.

source: 郁海珩以为无敌派其它弟子躲在里面，往里一看，却没发现任何身影，于是再次发了几道风刃道，“我到要看看，这偏殿中到底藏了什么，让你们……”
en_us: Yu Hai Heng thought that the other disciples of Invincible Sect were hiding inside, but he discovered that there was no one inside the Palace Wing. Once again, he summoned a few more wind blades and said, "I want to see what exactly you're hiding in this Palace Wing. I'll let you guys..."

source: 郁海珩冷笑了一声，“没想到你们这两卑贱的炉鼎，居然还认得本尊。”
en_us: Yu Haiheng laughed coldly. "I didn't expect you two despicable human cauldrons to recognize a Supremacy."

source: 郁海珩却以为他默认，眼神越加的轻视，突然扫到了什么，重重冷哼了一声，“你瞧那边，居然还有把凡人带上看台来的，以为这边是什么地方？随便什么人……”
en_us: However, Yu Haiheng took his silence for agreement. The expression in his eyes grew increasingly contemptuous. Having suddenly spotted something, he snorted coldly. "Look over there, there are actually people who bring mortals to the viewing platform. What do they think this place is? Any kind of people…"

source: 郁海珩却笑得越加的阴沉了，仿佛在逗人玩似的，突然唤出一道人高的风刃，朝两人攻击了过去。思羽一惊，硬接是不行了，只能运起全身所有的灵气，一拳打在那风刃之上，却也只使它偏离了一点，擦着两人往左侧飞了过去。
en_us: Yu Hai Heng laughed manically, as if he was playing a game. Suddenly, he summoned a wind blade as tall as himself and threw it toward the two girls. Si Yu quickly recovered from her shock and summoned all the Spirit Qi in her body, punching it out toward the wind blade. However, the Spirit Qi only managed to slightly change the blade's trajectory. The two girls had no choice but to shun toward the left.

source: 郁海珩只觉得从头到脚猛的一凉，那熟悉的语调，仿佛是从地狱钻出来一样。他甚至不敢动一下，明明什么都没有，他却感觉有什么铺天盖地的压了下来，一时间忘了怎么呼吸。
en_us: Yu Haiheng felt a cold shiver run down his spine, that familiar voice seemed to have come from the depths of hell. He didn't even dare to move, and although he was sure he saw nothing, he felt overcome by an overwhelming pressure, and for a moment he even forgot to breathe.

source: 郁海珩完全不懂他的眼神暗示，冷哼一声，直接转头看向印风，“印家主也认为振祥之死，是咎由自取吗？”
en_us: Yu Hai Heng totally did not understand his signalling, he sneered and looked directly at Yin Feng, "Does Master Yin also thinks that Zhen Xiang deserves to die?"

source: 郁海珩意识还没有回归，全身疼得已经快没知觉了，只觉得有什么正从身上急速流失，化神多年，这是他第一次知道，有人可以光凭拳头，就直接打散了他一身修为。再次对上眼前这张满是不耐的脸，心下升起的是满心的恐惧，这……真的只是修士吗？
en_us: Yu Haiheng had not yet regained his faculties. His whole body felt so painful that it had become numb. He could only feel something rapidly dissipating from his body. As someone who had been at the Soul Formation stage for many years, this was his first time learning that a person could undo a lifetime of cultivation just by using their fist. Now he was facing that very person again, and she was wearing a very impatient look on her face. Fear overwhelmed him. Was… she really only just a cultivator?

source: 郁海珩眼睛越睁越大，一脸的不敢置信，不，这不可能，她怎么会在这里？不是接了挑战去塑方城了吗？明心宗费晔书明明说看到人了，为什么她会出现在这！
en_us: Yu Haiheng’s eyes grew as big as saucers, an expression of total disbelief on his face. No, it was impossible. How could she be here? Hadn't she accepted the challenge and gone to Northern City? [1. An ancient city, https://en.wikipedia.org/wiki/Shuofang]. Bright Heart Sect's Fei Yueshu clearly said that he saw her, so how could she be here!

source: 郁海珩脸色却彻底的黑了，再没什么好辩的。振祥的事郁家也接到了些风声的，现在翻出来只是找个借口打压无敌派，但如果真找到振祥的身体，元婴尸身不腐，一探经脉那什么都清楚了。
en_us: Yu Hai Heng's face went completely black with no argument to refute her. The Yu Family had already received some news with the matters regarding Zhen Xiang. They were only using it as an excuse to suppress the Invincible Sect, but if they were to find Zhen Xiang's body, and as a Nascent Soul's corpse does not rot, a check of the meridians would clear everything up.

source: 郁海珩自那天晚上后，再没出现过，就连郁家也只说他失踪了。想起那个救走他们的人，他就忍不住有些担忧，有种莫名的预感，郁家绝对不会像轩辕家一样就这么怂了，没准正暗挫挫的憋个大招什么的，用不着多久，一定会找上门来。
en_us: Nobody saw Yu Hai Heng after that night. Even the Yu Family claimed that he was missing. Lonemoon felt uneasy just thinking about the people who saved Yu Hai Heng and the Traveling Immortals. Something in his gut told him that the Yu Family would not submit as easily as the Xuan Yuan Family did. Maybe they did have a big trick up their sleeves. Lonemoon expected them to turn up at their door soon.

source: 郁海珩顿时只觉得元神都有种被撕裂的感觉，视线都开始模糊起来，什么萝卜？他根本就没有拿她什么萝卜啊喂？
en_us: Yu Haiheng suddenly felt as if his Primordial Spirit was being torn apart and even his vision was becoming blurry. What radish? But he really hadn't taken any radish from her?

source: 郁海珩：“……”这轩辕禹是有病吧？
en_us: Yu Hai Heng: "..." This Xuan Yuanyu has some issue right?

source: 郁红一喜，“那仙师可否现在就带我们回派中去。”见对方怀疑，立马又解释，“我们几个姐妹自半月前起就出发来上青城，路途遥远，所以想赶紧回到派中休整。”
en_us: Yu Hong was delighted. "Then, can Immortal Master bring us back to the sect now?" But sensing suspicion from the other party, she immediately explained again, "We have spent half a month traveling to Upper Azure Town. The journey has been long and tiring, so we would like to return to the sect to rest."

source: 郁红一愣，回头看了众人一眼，才退了回去，“是！”
en_us: Yu Hong faltered for a moment before looking back at the girls and stepping back. "Yes!"

source: 郁红一愣，看了身侧的沈萤一眼，“她……是我一位朋友，只是送送我们，不会随我们去中青界。”
en_us: Yu Hong hesitated. She glanced at Shen Ying who was standing beside her and said, "She's… my friend. She's just sending us off. She won't be coming with us to the Middle Azure World."

source: 郁红一点头，扶住印元飞就往后退。
en_us: Yu Hong nodded and carrying Yin Yuanfei, started to back away.

source: 郁红也想到了这点，看了沈萤一眼，一咬牙，直接捏了个定身诀朝她胸口拍了过去，“姑娘，得罪了。”说完示意众人御剑，直接带着沈萤一块御剑飞出了无敌派。
en_us: Yu Hong had thought of this too. She turned to look at Shen Ying and immediately produced an Immobilizing Seal. She slapped the seal onto Shen Ying's chest and said, "Miss, I'm sorry." She signalled for the other girls to draw their swords. Taking Shen Ying with them, they rode their swords out of the Invincible Sect.

source: 郁红也是一惊，立马蹲下身一探他的经脉，却发现他金丹居然已经有崩碎的趋势，所以才昏迷不醒。
en_us: Yu Hong was also shocked. She immediately bent down to examine his meridians. She found that his Golden Core was about to disintegrate, which was why he was in a state of comatose.

source: 郁红也是一脸的震惊，虽然知道小门派所在处，必然不会是什么好的地点，却从来没想过对方会直接把她们带来了妖界。
en_us: Yu Hong was also wearing a face of shock. Although they knew that the location of a small sect would not be pristine, they had never imagined that the other party would bring them straight to the Demon Realm.

source: 郁红也确实负责，带着九个姐妹一起出了妖界。还特意分了九个不同的仙城方向，一人负责一个地方，不再仅限于上青城。不到半个月的功夫众人就带着招收到的弟子，浩浩荡荡的回来了。
en_us: Yu Hong was indeed responsible. She brought the other eight female cultivators out of the Demon Realm, and instructed them to head to different immortal towns. They were to recruit worthy disciples from these different towns - Invincible Sect was not limiting themselves to the Upper Azure Town. Within less than six months, the group proudly returned with new disciples.

source: 郁红内心一阵激动，却又隐隐泛上些许担忧，喜的是这样强大的门派，必然可以护众人周全，忧的是若是派中人知道她们的身份，那么会不会……
en_us: Yu Hong felt a rush of excitement, but had a slight worry in her mind. She was delighted as such a huge sect had to be capable of protecting the safety of everyone in her group, but she was worried that if someone in the sect were to find out their identities, that would result in…

source: 郁红却抬头看向旁边的沈萤，眼睛顿时就是一亮，轻轻的唤了一声，“掌门。”她张了张嘴角，似是想要露出个笑容让她放心，却掀动脸上的伤口，瞬间一滴鲜血就顺着脸侧滑了下来。
en_us: Yu Hong raised her head towards Shen Ying at the side, as her eyes lit up, she softly called out, "Sect Master." She opened her mouth try to show a smile to not let her worry but the wounds on her face immediately began to bleed.

source: 郁红却浑身冰凉，仿佛有丝丝寒气从骨缝里渗出来，就连在场的其它妹子也连连后退了几步，仿佛抑制不住似的微颤着。
en_us: However, Yu Hong's body became ice-cold as if a cold aura seeped out of her bone fissures, and even all of the other girls present took a couple of steps back like they could not endure the atmosphere, shivering.

source: 郁红却突然匆忙走了进来，递过来一只白色的纸鹤，“掌门，我刚刚在前殿发现了这个。”
en_us: Yu Hong suddenly hurried in and handed a white paper crane to her. "Sect Master, I just found this in the front hall."

source: 郁红只觉得巨大的威压铺天盖地而来，一咬牙直接就引动了体内的金丹，拼着自暴也要给身后的众人争取逃跑的时候。
en_us: Yu Hong could only feel an immense suppressive aura overwhelming her as she gritted her teeth and immediately activated the Golden Core inside of her—even if she were to blow up, she wanted to fight for more time to allow the rest to escape.

source: 郁红和思羽心底顿时一沉，警剔看向眼前的人，“你们怎么会在这里？”
en_us: Yu Hong and Si Yu’s hearts sank. Raising their guard, they looked at the people in front of them. "Why are you here?"

source: 郁红她们毕竟修为低，这印天城又是别人的地盘，还是回去妖界保险些。
en_us: Yu Hong's and the other sister's cultivation levels were still low afterall, and Yin Tian Town was someone else's territory. It would be much safer for them to return to the Demon Realm.

source: 郁红心下一紧，这是试探她们吗？这么大一个仙门，哪能容新入门的弟子乱闯，莫非她已经起疑了？
en_us: Yu Hong's heart contracted as she wondered: were they being tested? How could such a huge immortal sect allow the new disciples to barge in anywhere. Could the sect master already be suspicious of them?

source: 郁红抓着沈萤，带着众人一路飞出了妖界。原本她还有点担心会遇上高阶妖类，也不知道是不是她们幸运，这一路来居然没有正面遇到半只妖，就连偶尔看到一两只的身影，也转身往别的方向走了，意外顺畅的避开了。
en_us: Yu Hong grabbed Shen Ying and led the rest of the girls to fly out of the Demon Realm. She was initially worried that they would encounter a powerful demon, but they must have been lucky as they had already travelled half of the journey and they had not come across a single demon. They did see a couple of shadows, but those shadows had headed in the opposite direction from them. Surprisingly, their journey had been really smooth.

source: 郁红抓着身侧人的手紧了紧，连忙摇了摇头，压低声音道，“见机行事。”
en_us: Yu Hong grabbed the hand of the person beside her and squeezed it, then shook her head and said in a low volume, "Watch and wait to see what happens."

source: 郁红摇了摇头，“羿长老还未回来。”
en_us: Yu Hong shook her head, "Elder Yi hasn't returned."\

source: 郁红有些犹豫，回头看了看众人，还是跟了上去，“有劳道友。”
en_us: Yu Hong hesitated. She turned around to look at the other girls and then decided to follow him. "Thank you, Fellow Daoist."

source: 郁红深吸了一口气，带着同样面露喜色的姐妹们，小心翼翼的跟在了那人身后。一路穿过了好几条的街道，却不知为何，越走周围越加的热闹，男子并非带她们去到什么隐蔽的场所，反而来到了城中更加繁华的地界，最后停在了一座华美的宅邸前。
en_us: Yu Hong took a deep breath. She appeared as delighted as the other girls were as she carefully followed behind the man leading them. They went through several streets but somehow, the more they walked, the more crowded their surroundings became. The man did not bring them to some secluded area, but instead brought them to the town's more prosperous region before finally stopping before a magnificent residence.

source: 郁红点了点头。
en_us: Yu Hong noddd.

source: 郁红点了点头，她自然看得出，印元飞身上的伤是灵力所致，伤他的一定是个修士，连忙交待思羽道，“师妹，你先用灵气护住他的心脉，我去后山采株织灵草！”
en_us: Yu Hong nodded. She naturally saw that the injuries on Yin Yuanfei were caused by spiritual power. It must have been a cultivator who injured him. She quickly instructed to Si Yudao. "Junior Sister, protect his heart meridians with Spirit Qi first. I'm going to the back of the mountain to pick some Weaved Rhizomed Spirit Grass!"

source: 郁红疑惑的看了看两只八阶兔妖，抱拳道，“两位兔兄，不知道深夜前来所为何事？”
en_us: Looking at the two eighth-level rabbit demons with a puzzled expression, Yu Hong greeted them with cupped fists, "Brother Rabbits, may I know what brings you here this late in the night?"

source: 郁红神情变了变，立马又恢复上前一步道，“禀仙师，我等只是学过一些粗浅的引气入体的仙法。我是火木灵根，只修习过春华诀，至于其它的姐妹……”
en_us: Yu Hong's expression changed but returned back to normal again. She stepped forward and said, "Reporting to Immortal Master, we have only roughly learned a bit of the immortal Dharma of drawing aura into our body. I possess a Spirit Root of fire and wood and have only learned the Springbloom Art. As for the rest of the girls…"

source: 郁红脸上闪过一丝惊讶，看向他们的眼神，隐隐有些失落。回头跟后面的妹子们交换了一个眼神，咬了咬牙似是决定了什么，九人齐齐深吸了一口气，突然朝着他们就跪了下去。
en_us: Yu Hong was clearly surprised. After a moment, her face fell. She turned around to exchange looks with the girls behind her. Then, she gritted her teeth, as if she had decided on something. The nine of them breathed in simultaneously before they knelt in front of Shen Ying.

source: 郁红身后的众妹子，也纷纷朝着她拜了下去，齐齐出声道，“但请掌门吩咐。”
en_us: The girls behind Yu Hong also knelt down and said in unison, "Awaiting Sect Master's orders."

source: 郁红这才站了出来，看了她一眼道，“掌门，昨晚郁家家主带着十几个化神修士闯上山，我们打了起来，所以这里才……”
en_us: Yu Hong stood up and looked at her. "Sect Master, last night, the Yu Family Patriarch led a group of Soul Formation cultivators up the mountain and broke into our sect. We got into a fight so that is why..."

source: 郁红领会，立马上前一步带路，“两位请。”
en_us: Yu Hong understood and began to walk ahead of the guests, motioning for them to follow her, "This way, please."

source: 郁红：“……”
en_us: Yu Hong: "..."

source: 都招了，为什么还要打啊？还排成队是什么鬼？救命啊！
en_us: He already said he would speak; why were they still hitting him? What's wrong with these people? Help!

source: 都是TM沈萤害的！再说干嘛让他发落，你丫干嘛不去问那个吃货啊？
en_us: It’s all that f**king Shen Ying's fault! Besides, why ask me to pass judgment? Why don't you ask that foodie?

source: 钱万贯拍了拍胸脯道：“你放心，我们钱家的子弟最懂的就是做生意，要做生意首先得学会看人。在我看来大哥你绝非池中物，你这人情值得我全力投资，这可是一本万利的事情。”
en_us: Qian Wanguan struck his chest in assurance," Rest assured, doing business is the forte of us, descendants of The Qian Family. The first step to doing business is to have a good eye. To me, you are not just any Tom, Dick and Harry, and I will do my best in this high-profit returns investment."

source: 门口的掌柜笑着快步走了出来，“三位客……”话还没说完，三人已经消失在了天际。
en_us: The shop owner by the door quickly walked over with a smile. "Our three…" But before he could finish, they had already disappeared into the horizon.

source: 门派大比终于迎来了决赛，比起第一天来，这次来观赛的人更多。就连四大家族都来齐了，包括东道主的印家。
en_us: Finally, they had come to the finals of the competition amongst the sects. There were far more spectators compared to the first day. Even the four aristocratic families were present including the host, the Yin Family.

source: 门派大比结束后，孤月仿佛找到了人生的新目标，硬拖着在印天城多呆了几天，整天也不知道在忙些什么，大早就不见了人影，天黑才会回来。已经很久没有用生活费威胁过某人了。
en_us: Since the competiton amongst the sects ended, Lonemoon seemed to have found his new life goal. He made everybody stay for a few more days in Yin Tian Town. Each day, he went out early in the morning and came back late at night. Yet, nobody knew what he was up to. It had been a long time since he threatened Shen Ying with her allowance.

source: 闭关了整整三个多月的羿清终于睁开了眼睛，察觉到四周不同以往的灵气，立即反应过来，连忙引气入体。只见那些金色灵气，一点点的没入他的体内。直到完全容纳，无敌派上空的异象这才消失。
en_us: Yi Qing secluded himself for a total of over three months. Suddenly, he opened his eyes. The first thing he felt was that the Spirit Qi around him was different from before. He immediately reacted by sucking the Qi into his body. The golden spirit Qi flowed into his body until they were all gone. Only then did the Invincible Sect's appearance return to normal.

source: 队伍走得很快，不到片刻他们就到了最前面。沈萤这才看清，中间的地上，有着一个发光的图案，有些像是某些动画里的魔法阵，四周立着四根石柱，上面写着都是一些不认识的文字。人只要一走向那个图里，就消失了。
en_us: The queue moved very quickly, and within a short period of time they were at the very front of the line. Shen Ying finally had a clear view — there were glowing patterns in the center of the transportation area, some of which looked like the magic arrays that could be seen in cartoons. Surrounding them were four stone pillars that were inscribed with incomprehensible words. Once someone walked towards that pattern, they would disappear.
